Tekla Open API Reference for Tekla Structures 2025
Part.CastUnitType Property
 Gets or sets the cast unit type of the part.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part.CastUnitTypeEnum CastUnitType { get; set; }
Public Property CastUnitType As Part.CastUnitTypeEnum
	Get
	Set
Property Value
Type: Part.CastUnitTypeEnum
See Also
Reference
Part Class
Tekla.Structures.Model Namespace